app/views/employees/partials/_employee.html.erb

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 1]]
---
  <td><%= '%.2f' % employee.salary rescue '' %></td>
  <td><%= link_to employee.department.company.name, company_departments_path(employee.department.company) if employee.department.present? && employee.department.company.present? %></td>