app/views/employees/partials/_form.html.erb

SELECT `departments`.* FROM `departments`
---
      <%= f.label :department_id %><br/>
      <%= f.select :department_id, options_from_collection_for_select(departments, :id, :name, f.object.department_id), include_blank: '' %>

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", 5]]
---
<script>
  $(function () {
    var $form = $('#employee_form');
    $form.validate({
      rules: {
        "employee[name]": {
          required: true
        },
        "employee[salary]": {
          number: true
        }
      },
      errorPlacement: function (error, element) {
        $(element).closest('p').find('.help-block').text(error.text());
      },
      highlight: function (element) {
        $(element).closest('p').removeClass('has-success');
        $(element).closest('p').addClass('has-error');
      },
      unhighlight: function (element) {
        $(element).closest('p').removeClass('has-error');
      },