app/controllers/companies/departments_controller.rb

  def index
    @departments = Department.where(company_id: @company.id)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."company_id" = $1  ORDER BY "departments"."id" ASC LIMIT 1  [["company_id", 1]]
SELECT COUNT(*) FROM "departments" WHERE "departments"."company_id" = $1  [["company_id", 1]]

  def set_company
    @company = Company.includes(:departments).find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT 1  [["id", 1]]