app/controllers/departments/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."department_id" = $1  ORDER BY "employees"."id" ASC LIMIT 1  [["department_id", 1]]
---
  def index
    @employees = Employee.where(department_id: @department.id)

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "employees".* FROM "employees" WHERE "employees"."department_id" = $1  [["department_id", 2]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."id" IN (20, 17)
---
  def set_department
    @department = Department.includes(:employees).find(params[:department_id])