app/views/companies/partials/_form.html.erb

SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
<script>
  $(function () {
    var $form = $('#company_form');
    $form.validate({
      rules: {
        "company[name]": {
          required: true
        }
      },
      errorPlacement: function (error, element) {
        $(element).closest('p').find('.help-block').text(error.text());
      },
      highlight: function (element) {
        $(element).closest('p').removeClass('has-success');
        $(element).closest('p').addClass('has-error');
      },
      unhighlight: function (element) {
        $(element).closest('p').removeClass('has-error');
      },
      success: function (element) {
        $(element).closest('p').addClass('has-success');
      }