app/views/departments/partials/_form.html.erb

      <%= f.label :company_id %><br/>
      <%= f.select :company_id, options_from_collection_for_select(companies, :id, :name, f.object.company_id), include_blank: '' %>
---
SELECT `companies`.* FROM `companies`

      <%= f.label :super_department_id %><br/>
      <%= f.select :super_department_id, options_from_collection_for_select(departments, :id, :name, f.object.super_department_id), include_blank: '' %>
---
SELECT `departments`.* FROM `departments`

<script>
  $(function () {
    var $form = $('#department_form');
    $form.validate({
      rules: {
        "department[name]": {
          required: true
        }
      },
      errorPlacement: function (error, element) {
        $(element).closest('p').find('.help-block').text(error.text());
      },
      highlight: function (element) {
        $(element).closest('p').removeClass('has-success');
        $(element).closest('p').addClass('has-error');
      },
      unhighlight: function (element) {
        $(element).closest('p').removeClass('has-error');
      },
      success: function (element) {
        $(element).closest('p').addClass('has-success');
      }
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 2]]