app/views/departments/employees/index.html.erb

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 1]]
---
<div class="container">
  <h3>Employees of <%= @employees.first.department.name %></h3>