app/controllers/companies_controller.rb

  def create
    @company = Company.create(company_params)
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "eww"], ["created_at", "2016-05-08 20:12:22.413870"], ["updated_at", "2016-05-08 20:12:22.413870"]]

  def update
    @company.update(company_params)
---
UPDATE `companies` SET `name` = 'cds', `updated_at` = '2016-05-06 23:56:24' WHERE `companies`.`id` = 4

  def set_companies
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def set_departments
    @departments = Department.where(company_id: params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."company_id" = $1  [["company_id", 1]]
SELECT COUNT(*) FROM "departments" WHERE "departments"."company_id" = $1  [["company_id", 1]]