app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "feefe"], ["company_id", 1], ["created_at", "2016-05-08 20:12:28.457622"], ["updated_at", "2016-05-08 20:12:28.457622"]]
---
  def create
    @department = Department.create(department_params)

UPDATE `departments` SET `company_id` = 14, `super_department_id` = 2, `updated_at` = '2016-05-08 13:35:25' WHERE `departments`.`id` = 3
---
  def update
    @department.update(department_params)

DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 1]]
---
  def destroy
    @department.destroy

SELECT `departments`.* FROM `departments`
---
  def set_departments
    @departments = Department.all

SELECT `companies`.* FROM `companies`
---
  def set_companies
    @companies = Company.all

SELECT "employees".* FROM "employees" WHERE "employees"."department_id" = $1  [["department_id", 3]]
---
  def set_employees
    @employees = Employee.all