app/controllers/employees_controller.rb

  def create
    @employee = Employee.create(employee_params)
---
INSERT INTO "employees" ("name", "address", "salary", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Marco Schanz"], ["address", "Güls"], ["salary", 2300.0], ["department_id", 2], ["created_at", "2016-05-11 09:12:35.764878"], ["updated_at", "2016-05-11 09:12:35.764878"]]

  def update
    @employee.update(employee_params)
---
UPDATE "employees" SET "department_id" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["department_id", 1], ["updated_at", "2016-05-10 15:06:42.096558"], ["id", 1]]

  def cut
    set_employees
    employees_id_array = params[:format].split('/')
    if employees_id_array.size == 1
      @employee = Employee.where(id: employees_id_array)
---
SELECT "employees"."id" FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]

  def set_employees
    @employees = Employee.all
---
SELECT "employees"."id" FROM "employees"

  def set_departments
    @departments = Department.all
---
SELECT `departments`.* FROM `departments`